Repository: ScaredyCat/ADSL2-PCI-Card-Single-Port-ADSL-Modem
Catalog: opensource/sysstat-6.0.1/nls/*.po
Languages: pl

source: sysstat version %s (C) Sebastien Godard Usage: %s [ options... ] [ <interval> [ <count> ] ] Options are: [ -P { <cpu> | ALL } ] [ -V ]
pl: sysstat w wersji %s (C) Sebastien Godard U¿ycie: %s [ opcje... ] [ <interwa³> [ <powtórzenia> ] ] Mo¿liwe opcje: [ -P { <cpu> | ALL } ] [ -V ]

source: sysstat version %s (C) Sebastien Godard Usage: %s [ options... ] [ <interval> [ <count> ] ] Options are: [ -c | -d ] [ -k | -m ] [ -t ] [ -V ] [ -x ] [ <device> [ ... ] | ALL ] [ -p [ <device> | ALL ] ]
pl: sysstat w wersji %s (C) Sebastien Godard U¿ycie: %s [ opcje... ] [ <interwa³> [ <powtórzenia> ] ] Mo¿liwe opcje: [ -c | -d ] [ -k | -m ] [ -t ] [ -V ] [ -x ] [ <urz±dzenie> [ ... ] | ALL ] [ -p [ <urz±dzenie> | ALL ] ]

source: Time: %s
pl: Czas: %s

source: -x and -p options are mutually exclusive
pl: Opcje -x i -p wykluczaj± siê nazwajem

source: sysstat version %s (C) Sebastien Godard Usage: %s [ options... ] [ <interval> [ <count> ] ] Options are: [ -A ] [ -b ] [ -B ] [ -c ] [ -d ] [ -i <interval> ] [ -p ] [ -q ] [ -r ] [ -R ] [ -t ] [ -u ] [ -v ] [ -V ] [ -w ] [ -W ] [ -y ] [ -I { <irq> | SUM | ALL | XALL } ] [ -P { <cpu> | ALL } ] [ -n { DEV | EDEV | NFS | NFSD | SOCK | FULL } ] [ -x { <pid> | SELF | ALL } ] [ -X { <pid> | SELF | ALL } ] [ -o [ <filename> ] | -f [ <filename> ] ] [ -s [ <hh:mm:ss> ] ] [ -e [ <hh:mm:ss> ] ]
pl: sysstat w wersji %s (C) Sebastien Godard U¿ycie: %s [ opcje... ] [ <interwa³> [ <powtórzenia> ] ] Mo¿liwe opcje: [ -A ] [ -b ] [ -B ] [ -c ] [ -d ] [ -i <interwa³> ] [ -p ] [ -q ] [ -r ] [ -R ] [ -t ] [ -u ] [ -v ] [ -V ] [ -w ] [ -W ] [ -y ] [ -I { <irq> | SUM | ALL | XALL } ] [ -P { <cpu> | ALL } ] [ -n { DEV | EDEV | NFS | NFSD | SOCK | FULL } ] [ -x { <pid> | SELF | ALL } ] [ -X { <pid> | SELF | ALL } ] [ -o [ <plik> ] | -f [ <plik> ] ] [ -s [ <hh:mm:ss> ] ] [ -e [ <hh:mm:ss> ] ]

source: Not an SMP machine...
pl: Komputer niewieloprocesorowy...

source: Not that many processors!
pl: Nie ma a¿ tylu procesorów!

source: Error while reading system activity file: %s
pl: B³±d podczas czytania pliku aktywno¶ci systemu: %s

source: End of system activity file unexpected
pl: Niespodziewany koniec pliku aktywno¶ci systemu

source: Cannot open %s: %s
pl: Nie mo¿na otworzyæ %s: %s

source: Invalid system activity file: %s (%#x)
pl: Niepoprawny plik aktywno¶ci systemu: %s (%#x)

source: Invalid data format
pl: Niepoprawny format danych

source: Average:
pl: ¦rednia:

source: Requested activities not available in file
pl: ¯±dane statystyki nie s± dostêpne w pliku

source: Cannot write system activity file header: %s
pl: Nie mo¿na zapisaæ nag³ówka pliku aktywno¶ci systemu: %s

source: Cannot write data to system activity file: %s
pl: Nie mo¿na zapisaæ danych do pliku aktywno¶ci systemu: %s

source: Please give a smaller interval value
pl: Proszê podaæ mniejsz± warto¶æ interwa³u

source: Not reading from a system activity file (use -f option)
pl: Czytanie nie z pliku aktywno¶ci systemu (proszê u¿yæ opcji -f)

source: -f and -o options are mutually exclusive
pl: Opcje -f i -o siê wykluczaj±

source: Requested activities not available
pl: ¯±dane statystyki nie s± dostêpne

source: sysstat version %s (C) Sebastien Godard Usage: %s [ options... ] [ <interval> [ <count> ] ] [ <outfile> ] Options are: [ -d ] [ -F ] [ -I ] [ -V ]
pl: sysstat w wersji %s (C) Sebastien Godard U¿ycie: %s [ opcje... ] [ <interwa³> [ <powtórzenia> ] ] [ <plik_wyj¶ciowy> ] Mo¿liwe opcje: [ -d ] [ -F ] [ -I ] [ -V ]

source: Cannot append data to that file
pl: Nie mo¿na dopisaæ danych do tego pliku

source: Cannot handle so many processors!
pl: Zbyt du¿o procesorów!

source: sysstat version %s (C) Sebastien Godard Usage: %s [ options... ] [ <interval> [ <count> ] ] [ <datafile> ] Options are: [ -d | -H | -p | -x ] [ -t ] [ -V ] [ -P { <cpu> | ALL } ] [ -s [ <hh:mm:ss> ] ] [ -e [ <hh:mm:ss> ] ] [ -- <sar_options...> ]
pl: sysstat w wersji %s (C) Sebastien Godard U¿ycie: %s [ opcje... ] [ <interwa³> [ <powtórzenia> ] ] [ <plik> ] Mo¿liwe opcje: [ -d | -H | -p | -x ] [ -t ] [ -V ] [ -P { <cpu> | ALL } ] [ -s [ <hh:mm:ss> ] ] [ -e [ <hh:mm:ss> ] ] [ -- <sar_opcje...> ]
